tsung/simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
        <!-- Client side setup -->
        <clients>
                <client host="localhost" use_controller_vm="true" maxusers='1500'/>
        </clients>
        <!-- Server side setup -->
        <servers>
                <server host="hyhyh-load2.jm8qqevcmb.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
        </servers>
        <load>
                <arrivalphase phase="1" duration="30" unit="second">
                        <users arrivalrate="10" unit="second"/>
                </arrivalphase>

                <arrivalphase phase="2" duration="30" unit="second">
                        <users arrivalrate="20" unit="second"/>
                </arrivalphase>
                <arrivalphase phase="3" duration="30" unit="second">
                        <users arrivalrate="30" unit="second"/>
                </arrivalphase>
                <arrivalphase phase="4" duration="30" unit="second">
                        <users arrivalrate="40" unit="second"/>
                </arrivalphase>
                <arrivalphase phase="5" duration="30" unit="second">
                        <users arrivalrate="50" unit="second"/>
                </arrivalphase>
                <arrivalphase phase="6" duration="30" unit="second">
                        <users arrivalrate="60" unit="second"/>
                </arrivalphase>
                <arrivalphase phase="7" duration="30" unit="second">
                        <users arrivalrate="70" unit="second"/>
                </arrivalphase>

        </load>
        <options>
                <option name="global_ack_timeout" value="2000"/>
        </options>
        <sessions>
                <!-- Register as a new user. -->
                <session name="register-edit-logout" probability="100" type="ts_http">
                        <!-- Randomly generate the username and password -->
                        <setdynvars sourcetype="random_string" length="10">
                                <var name="username" />
                                <var name="password" />
                        </setdynvars>

                        <request subst="true">
                                <dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
                                <http url="/signup" version="1.1" method="GET"></http>
                        </request>
                                <thinktime value="2"></thinktime>

                        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                edoc_lib:escape_uri(binary_to_list(Val)) end.">
                                <var name="escaped_authenticity_token" />
                        </setdynvars>

                        <!-- Create the random account and get the userid -->
                        <request subst="true">
                                <dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
                                <http url='/users'
                                        version='1.1'
                                        method='POST'
                                        contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=%%_password%%&amp;user%5B                                password_confirmation%5D=%%_password%%&amp;commit=Create+Account'
                                        content_type="application/x-www-form-urlencoded"/>
                        </request>
                                <thinktime value="2"></thinktime>
                        <!-- Go to the settings page -->
                        <request subst="true">
                                <dyn_variable name="authenticity_token"></dyn_variable>
                                <http url="/users/%%_userid%%/edit" version="1.1" method="GET"/>
                        </request>

                        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                edoc_lib:escape_uri(binary_to_list(Val)) end.">
                                <var name="escaped_authenticity_token" />
                        </setdynvars>

                        <!-- Update user's profile -->
                        <request subst="true">
                                <http url="/users/%%_userid%%"
                                        version="1.1"
                                        method="PATCH"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%&amp;username=%%_username%%&amp;avatar=https://cdn.newsapi.com.au/image/v1/9fdbf585d17                                c95f7a31ccacdb6466af9&amp;originalpassword=%%_password%%;&amp;email=%%_username%%@gmail.com"
                                        content_type="application/x-www-form-urlencoded"/>
                        </request>

                        <!-- Logout -->
                        <request subst="true">
                                <http url="/logout" method="DELETE" />
                        </request>
                </session>
        </sessions>
</tsung>